In [3]:
# 1. Numpy function can be applied directly to arrays.
ls = [1, 3, 5, 10]

# Without Numpy
ls2 = []
for x in ls:
    ls2.append(x ** 2)
print(ls2)

# With Numpy
import numpy as np
ls3 = np.power(ls, 2)
print(ls3)

[1, 9, 25, 100]
[  1   9  25 100]

In [5]:
# A single : symbol is useful in high dimentional arrays.
ls = np.array([[1, 2, 3],
              [4, 5, 6],
              [7, 8, 9],
              [10, 11, 12]])
ls[:, 0]

array([ 1,  4,  7, 10])

In [6]:
# Additional examples of list comprehension
ls = [5, 3, 2, 4]
ls2 = [2*x for x in ls]
print(ls2)

[10, 6, 4, 8]

In [10]:
# How to apply a function to a data frame or a column from a data frame.
import pandas as pd
df = pd.DataFrame([["Alice", 5],
                   ["Bob", 15],
                   ["Charlie", 25]],
                  columns=["Name", "Number"])

df

      Name  Number
0    Alice       5
1      Bob      15
2  Charlie      25

In [11]:
def get_initial(name):
    return name[0]

df['Initials'] = df["Name"].apply(get_initial)
df

      Name  Number Initials
0    Alice       5        A
1      Bob      15        B
2  Charlie      25        C

In [15]:
def get_initial(row):
    return row["Name"][0]

df['Initials'] = df.apply(get_initial, axis=1)
df

      Name  Number Initials
0    Alice       5        A
1      Bob      15        B
2  Charlie      25        C